Lumi-net/esp32-s3-lora-chat/sdkconfig.defaults
# sdkconfig.defaults — ELC (ESP32-S3 LoRa Chat)
# Non-default settings required for a fresh build.
# Run `idf.py build` to merge into sdkconfig.

# --- Target ---
CONFIG_IDF_TARGET="esp32s3"

# --- Flash ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# --- Partition Table ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_user.csv"

# --- PSRAM (Octal, 80 MHz) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# --- FreeRTOS (allow tasks in PSRAM) ---
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y

# --- CPU / Clock ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# --- Cache ---
CONFIG_ESP32S3_INSTRUCTION_CACHE_16KB=y
CONFIG_ESP32S3_DATA_CACHE_32KB=y

# --- Light Sleep ---
CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP=y
CONFIG_PM_RESTORE_CACHE_TAGMEM_AFTER_LIGHT_SLEEP=y

# --- Watchdog ---
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5

# --- Main task stack (LVGL needs more) ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=3584

# --- LVGL (Kconfig-driven, no lv_conf.h) ---
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
CONFIG_LV_USE_FLEX=y
CONFIG_LV_USE_GRID=y
CONFIG_LV_OS_NONE=y
CONFIG_LV_TXT_ENC_UTF8=y
CONFIG_LV_USE_THEME_DEFAULT=y
CONFIG_LV_USE_THEME_SIMPLE=y
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
